In [1]:
import os
os.chdir('../')
os.getcwd()

'/home/jhbale11/Query-Machine'

In [2]:
from querymachine import QueryMachine

In [3]:
import pandas as pd
import seaborn as sns

<frozen importlib._bootstrap>:228: RuntimeWarning: scipy._lib.messagestream.MessageStream size changed, may indicate binary incompatibility. Expected 56 from C header, got 64 from PyObject

In [4]:
# Main dataset to show datasloth capabilities
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
qm = QueryMachine()

In [10]:
qm.query("titanic에서 살아남은 남성의 나이의 평균을 알려줘", show_query=True)

SELECT AVG(age) AS avg_age
FROM titanic
WHERE survived = 1 AND sex = 'male'

     avg_age
0  27.276022

In [11]:
qm.query("혼자서 여행하는 남성이 지불하는 fare의 평균을 알려줘", show_query=True)

SELECT AVG(fare) AS avg_fare
FROM titanic
WHERE adult_male = 'True' AND alone = 'True'

  avg_fare
0     None

In [12]:
qm.query("남성 생존자의 비율을 알려줘", show_query=True)

SELECT (SUM(CASE WHEN survived = 1 AND sex = 'male' THEN 1.0 END) / COUNT(*)) * 100 AS percentage
FROM titanic

   percentage
0   12.233446

In [13]:
qm.query("성별에 따른 타이타닉 생존 비율을 알려줘", show_query=True)

SELECT sex, (SUM(CASE WHEN survived = 1 THEN 1.0 END) / COUNT(*)) * 100 AS survival_rate
FROM titanic
GROUP BY sex

      sex  survival_rate
0  female      74.203822
1    male      18.890815